<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [140]:
import pandas as pd
import numpy as np

# Add & Alter

## direct insert

In [141]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [142]:
df['salary'] = 0
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

## by other columns

In [143]:
df['salary'] = df['age'] * 300
df

    name  age        job  salary
0   Jone   15    student    4500
1  Jenny   30  developer    9000
2   Nate   30    teacher    9000

In [144]:
df['details'] = 'Name is ' + df['name'] + ', Job is ' + df['job']
df

    name  age        job  salary                          details
0   Jone   15    student    4500     Name is Jone, Job is student
1  Jenny   30  developer    9000  Name is Jenny, Job is developer
2   Nate   30    teacher    9000     Name is Nate, Job is teacher

In [145]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

## by list

In [146]:
df['Gender'] = ['M','F','M']
df

    name  midterm  final Gender
0   John       95     85      M
1  Jenny       85     80      F
2   Nate       10     30      M

## by condition

In [147]:
df['total'] = df['midterm'] + df['final']
df['average'] = df['total'] / 2
df

    name  midterm  final Gender  total  average
0   John       95     85      M    180     90.0
1  Jenny       85     80      F    165     82.5
2   Nate       10     30      M     40     20.0

In [148]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades
df

    name  midterm  final Gender  total  average grade
0   John       95     85      M    180     90.0     A
1  Jenny       85     80      F    165     82.5     B
2   Nate       10     30      M     40     20.0     F

## with numpy

In [149]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [150]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

# Apply

In [151]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df['total'] = df['midterm'] + df['final']
df['average'] = df['total'] / 2
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

## 1. 사용할 함수를 정의한다.

In [152]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

## `df[저장할 컬럼] = df.적용할컬럼.apply(함수)`

In [153]:
df['result'] = df.grade.apply(pass_or_fail)
df

A
B
F

    name  midterm  final  total  average grade result
0   John       95     85    180     90.0     A   Pass
1  Jenny       85     80    165     82.5     B   Pass
2   Nate       10     30     40     20.0     F   Fail

In [154]:
date_list = [{'yyyy-mm-dd': '1999-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  1999-06-27
1  2002-09-24
2  2005-12-20

In [155]:
def extract_year(row):
    return row.split('-')[0]
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  1999-06-27  1999
1  2002-09-24  2002
2  2005-12-20  2005

## apply 함수에 파라미터 전달하기
* 키워드 파라미터를 사용하시면, apply가 적용된 함수에 파라미터를 전달 하실 수 있습니다.

In [156]:
def extract_age(year, current_year):
    return current_year -int(year)

In [157]:
df['age'] = df['year'].apply(extract_age, current_year=2018)
df

   yyyy-mm-dd  year  age
0  1999-06-27  1999   19
1  2002-09-24  2002   16
2  2005-12-20  2005   13

## lambda 활용 하기

In [158]:
df['year2'] = df['yyyy-mm-dd'].apply(lambda x : x.split('-')[0] )
df

   yyyy-mm-dd  year  age year2
0  1999-06-27  1999   19  1999
1  2002-09-24  2002   16  2002
2  2005-12-20  2005   13  2005

In [159]:
df['C'] = df['yyyy-mm-dd'].apply(lambda x : '19C' if int(x.split('-')[0]) <= 1999 else '20C')
df

   yyyy-mm-dd  year  age year2    C
0  1999-06-27  1999   19  1999  19C
1  2002-09-24  2002   16  2002  20C
2  2005-12-20  2005   13  2005  20C

## apply 함수에 한 개 이상의 파라미터 전달하기
* 키워드 파라미터를 추가해주시면, 원하시는만큼의 파라미터를 함수에 전달 가능합니다.

In [160]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")
df

   yyyy-mm-dd  year  age year2    C          introduce
0  1999-06-27  1999   19  1999  19C  I am 19 years old
1  2002-09-24  2002   16  2002  20C  I am 16 years old
2  2005-12-20  2005   13  2005  20C  I am 13 years old

## 여러개의 컬럼을 동시에 전달하기

* **`axis = 1`** 이라는 키워드 파라미터를 apply 함수에 전달해주면, 모든 컬럼을 지정된 함수에서 사용 가능합니다.

In [163]:
date_list = [{'yyyy-mm-dd': '1999-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df['year'] = df['yyyy-mm-dd'].apply(lambda x : x[:4])
df['age'] = df['year'].apply(extract_age, current_year=2018)
df

   yyyy-mm-dd  year  age
0  1999-06-27  1999   19
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [164]:
def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)

df['introduce'] = df.apply(get_introduce2, axis=1)
df

   yyyy-mm-dd  year  age                        introduce
0  1999-06-27  1999   19  I was born in 1999 my age is 19
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

## Map 함수로 컬럼 추가 및 변경하기
파라미터로 함수를 전달하면 apply 함수와 동일하게 컬럼값을 추가 및 변경할 수 있습니다

In [181]:
def extract_year(row):
    return row.split('-')[0]

date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [182]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

파라미터로 딕셔너리를 전달하면 컬럼값을 쉽게 원하는 값으로 변경 가능합니다.   

기존의 컬럼값은 딕셔너리의 key로 사용되고, 해당되는 value의 값으로 컬럼값이 변경됩니다.

In [183]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [184]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

## Applymap
데이터프레임 전체의 각각의 값을 한번에 변경시키실 때 사용하시면 좋습니다.

In [185]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [186]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# Drop

In [133]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## drop(axis=)

* inplace= True 를 사용하면 바로 드랍 한 값을 반영할수 있다.

In [134]:
df.drop('age', axis=1)

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

In [135]:
df.drop(0, axis=0)

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

##  dropna(axis = )

In [136]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': np.NaN, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name   age        job
0   Jone  20.0    student
1  Jenny  30.0  developer
2   Nate   NaN    teacher

In [137]:
df.dropna(axis=0)

    name   age        job
0   Jone  20.0    student
1  Jenny  30.0  developer

In [138]:
df.dropna(axis=1)

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

## 중복 데이터 드롭하기
중복된 데이터 드롭하는 방법에 대해 알아보겠습니다.

### 전체가 중복된거 찾기

In [187]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [188]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [190]:
df = df.drop_duplicates()
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

### 특정 컬럼이 중복 된거 찾기

In [191]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [192]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

* keep 값을 first 또는 last라고 값을 줘서 중복된 값 중, 어느값을 살릴 지 결정하실 수 있습니다.  


* 기본적으로 first로 설정되어 있습니다.

In [194]:
df.drop_duplicates(['name'], keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

Apply 는 중요한대 너무 어렵다...

밑에 2 site로 drill 해주세요~

https://data-newbie.tistory.com/207

http://www.leejungmin.org/post/2018/04/21/pandas_apply_and_map/

출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas